project/results/nginx/ab_no-runtime.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 3000 requests
Completed 6000 requests
Completed 9000 requests
Completed 12000 requests
Completed 15000 requests
Completed 18000 requests
Completed 21000 requests
Completed 24000 requests
Completed 27000 requests
Completed 30000 requests
Finished 30000 requests


Server Software:        nginx/1.25.5
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        615 bytes

Concurrency Level:      20
Time taken for tests:   3.451 seconds
Complete requests:      30000
Failed requests:        0
Total transferred:      25440000 bytes
HTML transferred:       18450000 bytes
Requests per second:    8693.81 [#/sec] (mean)
Time per request:       2.300 [ms] (mean)
Time per request:       0.115 [ms] (mean, across all concurrent requests)
Transfer rate:          7199.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.3      1       3
Processing:     0    2   0.9      2      31
Waiting:        0    1   0.9      1      31
Total:          0    2   0.9      2      32

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      3
  90%      3
  95%      3
  98%      4
  99%      4
 100%     32 (longest request)

real	0m3.516s
user	0m0.386s
sys	0m2.996s